In [83]:
# Import Libraries and Dependencies
import pandas as pd

### Read in files

In [84]:
# Read in data and index by CustomerID
jan = pd.read_csv('Resources/Jan2019_sales.csv', index_col='order_ID')
feb = pd.read_csv('Resources/Feb2019_sales.csv', index_col='order_ID')
mar = pd.read_csv('Resources/March2019_sales.csv', index_col='order_ID')

In [85]:
# Show sample of January sales data.
jan.head(5)

,product,quantity_ordered,price,order_date,state,city,zip_code
order_ID,,,,,,,
141234,iPhone,1,700.00,01/22/19 21:25,FL,Orlando,32807
141235,Lightning Charging Cable,1,14.95,01/28/19 14:15,FL,Miami,33137
141236,Wired Headphones,2,11.99,01/17/19 13:33,GA,Atlanta,30318
141237,27in FHD Monitor,1,149.99,01/05/19 20:33,CA,Los Angeles,90014
141238,Wired Headphones,1,11.99,01/25/19 11:59,CA,San Francisco,94016

In [86]:
# Show sample of February sales data.
feb.head(5)

,product,quantity_ordered,price,order_date,state,city,zip_code
order_ID,,,,,,,
150502,iPhone,1,700.00,02/18/19 01:35,PA,Philadelphia,19132
150503,AA Batteries (4-pack),1,3.84,02/13/19 07:24,CA,San Diego,91911
150504,27in 4K Gaming Monitor,1,389.99,02/18/19 09:46,CA,San Diego,91911
150505,Lightning Charging Cable,1,14.95,02/02/19 16:47,FL,Orlando,32822
150506,AA Batteries (4-pack),2,3.84,02/28/19 20:32,WA,Seattle,98115

In [87]:
# Show sample of March sales data.
mar.head(5)

,product,quantity_ordered,price,order_date,state,city,zip_code
order_ID,,,,,,,
162009,iPhone,1,700.00,03/28/19 20:59,CA,Los Angeles,90008
162009,Lightning Charging Cable,1,14.95,03/28/19 20:59,TX,Austin,78729
162009,Wired Headphones,2,11.99,03/28/19 20:59,OR,Portland,97209
162010,Bose SoundSport Headphones,1,99.99,03/17/19 05:39,FL,Miami,33125
162011,34in Ultrawide Monitor,1,379.99,03/10/19 00:01,CA,San Diego,92029

### Check the data types of each DataFrame

In [88]:
# Jan sales datatypes
jan.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9681 entries, 141234 to 150501
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   product           9681 non-null   object
 1   quantity_ordered  9681 non-null   int64
 2   price             9681 non-null   float64
 3   order_date        9681 non-null   object
 4   state             9681 non-null   object
 5   city              9681 non-null   object
 6   zip_code          9681 non-null   int64
dtypes: float64(1), int64(2), object(4)
memory usage: 605.1+ KB

In [89]:
# Feb sales datatypes
feb.info()

<class 'pandas.core.frame.DataFrame'>
Index: 11986 entries, 150502 to 162008
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   product           11986 non-null  object
 1   quantity_ordered  11986 non-null  int64
 2   price             11986 non-null  float64
 3   order_date        11986 non-null  object
 4   state             11986 non-null  object
 5   city              11986 non-null  object
 6   zip_code          11986 non-null  int64
dtypes: float64(1), int64(2), object(4)
memory usage: 749.1+ KB

In [90]:
# March sales datatypes
mar.info()

<class 'pandas.core.frame.DataFrame'>
Index: 15154 entries, 162009 to 176557
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   product           15154 non-null  object
 1   quantity_ordered  15154 non-null  int64
 2   price             15154 non-null  float64
 3   order_date        15154 non-null  object
 4   state             15154 non-null  object
 5   city              15154 non-null  object
 6   zip_code          15154 non-null  int64
dtypes: float64(1), int64(2), object(4)
memory usage: 947.1+ KB

### Combine the sales data by rows.

In [91]:
# Combine the January, February, and March sales DataFrames on the rows using an inner join, and reset the index
sales = pd.concat([jan, feb,mar], axis=0, ignore_index=False).reset_index()

sales.head(2)

,order_ID,product,quantity_ordered,price,order_date,state,city,zip_code
0,141234,iPhone,1,700.00,01/22/19 21:25,FL,Orlando,32807
1,141235,Lightning Charging Cable,1,14.95,01/28/19 14:15,FL,Miami,33137

In [92]:
# Check if any values are null.
sales.isna().sum()

order_ID            0
product             0
quantity_ordered    0
price               0
order_date          0
state               0
city                0
zip_code            0
dtype: int64

In [93]:
# Check the data type of each column
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 36821 entries, 0 to 36820
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   order_ID          36821 non-null  int64
 1   product           36821 non-null  object
 2   quantity_ordered  36821 non-null  int64
 3   price             36821 non-null  float64
 4   order_date        36821 non-null  object
 5   state             36821 non-null  object
 6   city              36821 non-null  object
 7   zip_code          36821 non-null  int64
dtypes: float64(1), int64(3), object(4)
memory usage: 2.2+ MB

In [177]:
# Convert the "order_date" column to a datetime datatype.
sales['order_date'] = pd.to_datetime(sales['order_date'],format='%Y-%m-%d')

In [178]:
# Confirm that the data type has been changed.
sales['order_date'].head(10)

0   2019-01-22 21:25:00
1   2019-01-28 14:15:00
2   2019-01-17 13:33:00
3   2019-01-05 20:33:00
4   2019-01-25 11:59:00
5   2019-01-29 20:22:00
6   2019-01-26 12:16:00
7   2019-01-05 12:04:00
8   2019-01-01 10:30:00
9   2019-01-22 21:20:00
Name: order_date, dtype: datetime64[ns]

### 1. Which top five zip codes in which cities and states had the greatest number of products ordered?

### Using `groupby`

In [125]:
# Show the average number items ordered for each state, city, and zip code.
# Rename the sum column to reflect the data in the column.

total_order = sales.groupby(['zip_code','city','state']).agg({'quantity_ordered':'sum'}).reset_index()

# Show the top 5 results.
total_order.rename(columns={'quantity_ordered':'sum'},inplace= True)

top_5_qty = total_order.sort_values('sum',ascending= False).head(5)
top_5_qty

    zip_code           city state  sum
26     60629        Chicago    IL  909
40     92029      San Diego    CA  873
39     91911      San Diego    CA  870
0      10001  New York City    NY  866
18     43201       Columbus    OH  866

### Using `pivot_table`

In [129]:
# Show the total number of items ordered for each state, city, and zip code.
qty_pivot = top_5_qty.pivot(index = ['city','state'],columns=['zip_code'], values='sum')

# Rename the "sum" column to "Avg_Number_Products_Ordered"


# Show the top 5 results.
qty_pivot

zip_code             10001  43201  60629  91911  92029
city          state
Chicago       IL       NaN    NaN  909.0    NaN    NaN
Columbus      OH       NaN  866.0    NaN    NaN    NaN
New York City NY     866.0    NaN    NaN    NaN    NaN
San Diego     CA       NaN    NaN    NaN  870.0  873.0

### 2. Which top five zip codes in which cities and states generated the most sales?

### Using `groupby`

In [131]:
# Show the total price for the items ordered for each state, city, and zip code.
sales_price = sales.groupby(['zip_code','city','state']).agg({'price':'sum'}).reset_index()


# Rename the sum column to reflect the data in the column.
sales_price.rename(columns={'price':'total_price'},inplace= True)

# Show the top 5 results.
top_5_price = sales_price.sort_values('total_price',ascending= False).head(5)
top_5_price

    zip_code           city state  total_price
3      14201        Buffalo    NY    155976.70
26     60629        Chicago    IL    150667.34
40     92029      San Diego    CA    150305.41
43     94102  San Francisco    CA    146115.98
1      10013  New York City    NY    145934.27

### Using `pivot_table`

In [170]:
# Show the total price for all of the items ordered for each state, city, and zip code.
price_pivot = top_5_price.pivot(index = ['city','state'],columns=['zip_code'], values='total_price').fillna('')

# Rename the "price" column to "Avg_Number_Products_Ordered"

# Show the top 5 results.
price_pivot

zip_code                 10013     14201      60629      92029      94102
city          state
Buffalo       NY                155976.7
Chicago       IL                          150667.34
New York City NY     145934.27
San Diego     CA                                     150305.41
San Francisco CA                                                146115.98

### 3. Which top five zip codes in which cities and states had the greatest average price for the products ordered?

### Using `groupby`

In [134]:
# Show the average price of items ordered for each state, city, and zip code rounded to two decimal places.
avg_price = sales.groupby(['zip_code','city','state']).agg({'price':'mean'}).reset_index()
# Rename the mean column to reflect the data in the column.
avg_price.rename(columns={'price':'avg_price'},inplace= True)

# Show the top 5 results.
top_5_avg_price = avg_price.sort_values('avg_price',ascending= False).head(5)
top_5_avg_price

    zip_code           city state   avg_price
1      10013  New York City    NY  212.113765
43     94102  San Francisco    CA  210.845570
35     78745         Austin    TX  205.631276
3      14201        Buffalo    NY  203.891111
40     92029      San Diego    CA  196.734830

### Using `pivot_table`

In [168]:
# Show the average price per product ordered for each state, city, and zip code rounded to two decimal places.


# Rename the "price" column to "Avg_Price"


# Show the top 5 results.
avg_price_pivot = top_5_avg_price.pivot(index = ['city','state'],columns=['zip_code'], values='avg_price').fillna('')
avg_price_pivot

zip_code                  10013       14201       78745      92029      94102
city          state
Austin        TX                             205.631276
Buffalo       NY                 203.891111
New York City NY     212.113765
San Diego     CA                                         196.73483
San Francisco CA                                                    210.84557

### 4. Which top five zip codes in which cities and states had the most iPhone sales?

In [139]:
# Filter the sales data to get the iPhone sales data.

sales['product'].str.contains('iphone')
iphone_sales = sales[sales['product'].str.contains('iphone',case=False)]

iphone_sales

,order_ID,product,quantity_ordered,price,order_date,state,city,zip_code,total_price
0,141234,iPhone,1,700.0,2019-01-22 21:25:00,FL,Orlando,32807,700.0
104,141336,iPhone,1,700.0,2019-01-09 18:23:00,IL,Chicago,60629,700.0
164,141394,iPhone,1,700.0,2019-01-06 16:54:00,TX,Dallas,75201,700.0
207,141437,iPhone,1,700.0,2019-01-10 15:40:00,FL,Miami,33125,700.0
228,141457,iPhone,1,700.0,2019-01-09 22:11:00,TX,Austin,78745,700.0
...,...,...,...,...,...,...,...,...,...
36737,176479,iPhone,1,700.0,2019-03-29 14:42:00,FL,Miami,33186,700.0
36742,176484,iPhone,1,700.0,2019-03-17 15:59:00,WA,Seattle,98101,700.0
36747,176487,iPhone,1,700.0,2019-03-14 14:46:00,TX,Dallas,75209,700.0
36811,176549,iPhone,1,700.0,2019-03-20 01:24:00,FL,Miami,33186,700.0
36819,176557,iPhone,1,700.0,2019-03-30 12:32:00,TX,Austin,78701,700.0

### Using `groupby`

In [173]:
# Show the total number of items ordered for each state, city, and zip code.
total_iphone_sales = iphone_sales.groupby(['zip_code','city','state']).agg({'quantity_ordered':'sum'})
# Rename the count column to reflect the data in the column.
total_iphone_sales.rename(columns={'quantity_ordered':'number_ordered'},inplace=True)
top_5_total_iphone_sales=total_iphone_sales.reset_index().sort_values('number_ordered',ascending= False).head(5)

top_5_total_iphone_sales

    zip_code           city state  number_ordered
0      10001  New York City    NY              40
1      10013  New York City    NY              36
3      14201        Buffalo    NY              35
33     78701         Austin    TX              34
43     94102  San Francisco    CA              33

### Using `pivot_table`

In [176]:
# Show the total number of items ordered for each city and zip code.

# Rename the "quantity_ordered" column to "Number_Ordered"


# Show the top 5 results.
top_5_total_iphone_sales.pivot(index = ['city','state'],columns=['zip_code'],values= 'number_ordered').fillna('')

zip_code            10001 10013 14201 78701 94102
city          state
Austin        TX                       34.0
Buffalo       NY                 35.0
New York City NY     40.0  36.0
San Francisco CA                             33.0

### 5. Which day had the most iPhone sales?

In [210]:
# Create a pivot table with the 'order_date' as the index and the "price" as the values.


# Rename the "price" column to "Total_Sales"
daily_total_sales = sales.groupby('order_date').agg({'price':'sum'})
daily_total_sales.rename(columns={'price':'total_sales'},inplace= True)

top_5_daily_sales= daily_total_sales.sort_values('total_sales',ascending= False)



# Show the table.
top_5_daily_sales

                     total_sales
order_date
2019-03-29 21:17:00      3414.95
2019-01-20 00:15:00      3400.00
2019-02-22 21:06:00      3400.00
2019-02-26 17:12:00      3400.00
2019-03-30 10:47:00      3400.00
...                          ...
2019-02-03 20:39:00         2.99
2019-02-03 20:23:00         2.99
2019-02-03 20:02:00         2.99
2019-02-03 18:05:00         2.99
2019-02-05 17:31:00         2.99

[29485 rows x 1 columns]

In [211]:
# Resample the pivot table into daily bins 
daily_sales_sample = sales[['order_date','price']]
daily_sales_sample['order_date']  = daily_sales_sample['order_date'].dt.date

# and get the total sales for each day rounded to two decimal places.
daily_total_sales_sample = daily_sales_sample.groupby('order_date').agg({'price':'sum'})
daily_total_sales_sample.rename(columns={'price':'total_sales'},inplace= True)

# Sort the resampled pivot table in ascending order on "Total_Sales".
daily_total_sales_sample.sort_values('total_sales',ascending=True)

C:\Users\hafto\AppData\Local\Temp\ipykernel_34036\496618205.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  daily_sales_sample['order_date']  = daily_sales_sample['order_date'].dt.date

            total_sales
order_date
2019-04-01      5167.43
2019-01-05     46160.62
2019-01-03     46793.74
2019-01-12     47792.25
2019-01-18     48291.98
...                 ...
2019-03-26     98513.15
2019-03-05     99455.47
2019-03-18    100291.58
2019-03-25    101101.30
2019-03-22    102516.59

[91 rows x 1 columns]

### 6.  Which week had the most iPhone sales?

In [239]:
# Resample the pivot table into weekly bins 
# and get the total sales for each week rounded to two decimal places.
weekly_sales = sales[['order_date','price']]
weekly_sales['week'] = weekly_sales['order_date'].dt.isocalendar().week
weekly_total_sales = weekly_sales.groupby('week').agg({'price':'sum'})

# Sort the resampled pivot table in ascending order on "Total_Sales".
weekly_total_sales.rename(columns={'price':'total_sales'},inplace=True)

weekly_total_sales['total_sales'] = weekly_total_sales['total_sales'].round(2)

weekly_total_sales.sort_values('total_sales',ascending= True)

C:\Users\hafto\AppData\Local\Temp\ipykernel_34036\3229123121.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  weekly_sales['week'] = weekly_sales['order_date'].dt.isocalendar().week

      total_sales
week
14        5167.43
1       343062.87
3       392745.06
2       407539.11
4       424518.30
5       456563.41
8       530962.84
6       563327.94
7       565026.42
9       575845.83
11      593018.15
12      626002.79
10      637208.90
13      667535.91